
## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/90314100/runs/450e1ac3-da74-4803-83cd-6a3ea2e68487).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>

## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.launch_instance["vm-test-0***"].proxmox_virtual_environment_file.user_data_cloud_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "user_data_cloud_config" {
+       file_modification_date = (known after apply)
!       file_name              = "user-data-cloud-config.yaml" -> (known after apply)
+       file_size              = (known after apply)
+       file_tag               = (known after apply)
!       id                     = "local:snippets/user-data-cloud-config.yaml" -> (known after apply)
        # (5 unchanged attributes hidden)
!
       source_raw {
!           data      = <<-EOT # forces replacement
-               #cloud-config
-               hostname: test-ubuntu
-               timezone: Asia/Manila
-               package_update: true
-               packages:
-                 - qemu-guest-agent
-                 - net-tools
-                 - curl
-               runcmd:
-                 - systemctl enable qemu-guest-agent
-                 - systemctl start qemu-guest-agent
+               #cloud-config
+               timezone: Asia/Manila
+               package_update: true
+               packages:
+                 - qemu-guest-agent
+                 - net-tools
+                 - curl
+               runcmd:
+                 - systemctl enable qemu-guest-agent
+                 - systemctl start qemu-guest-agent
-                   echo "done" > /tmp/cloud-config.done
            EOT
            # (2 unchanged attributes hidden)
        }
    }

  # module.launch_instance["vm-test-02"].proxmox_virtual_environment_file.user_data_cloud_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "user_data_cloud_config" {
+       file_modification_date = (known after apply)
!       file_name              = "user-data-cloud-config.yaml" -> (known after apply)
+       file_size              = (known after apply)
+       file_tag               = (known after apply)
!       id                     = "local:snippets/user-data-cloud-config.yaml" -> (known after apply)
        # (5 unchanged attributes hidden)
!
       source_raw {
!           data      = <<-EOT # forces replacement
-               #cloud-config
-               hostname: test-ubuntu
-               timezone: Asia/Manila
-               package_update: true
-               packages:
-                 - qemu-guest-agent
-                 - net-tools
-                 - curl
-               runcmd:
-                 - systemctl enable qemu-guest-agent
-                 - systemctl start qemu-guest-agent
+               #cloud-config
+               timezone: Asia/Manila
+               package_update: true
+               packages:
+                 - qemu-guest-agent
+                 - net-tools
+                 - curl
+               runcmd:
+                 - systemctl enable qemu-guest-agent
+                 - systemctl start qemu-guest-agent
-                   echo "done" > /tmp/cloud-config.done
            EOT
            # (2 unchanged attributes hidden)
        }
    }

  # module.launch_instance["vm-test-03"].proxmox_virtual_environment_file.user_data_cloud_config will be destroyed
  # (because module.launch_instance["vm-test-03"] is not in configuration)
-   resource "proxmox_virtual_environment_file" "user_data_cloud_config" {
-       content_type   = "snippets" -> null
-       datastore_id   = "local" -> null
-       file_name      = "user-data-cloud-config.yaml" -> null
-       id             = "local:snippets/user-data-cloud-config.yaml" -> null
-       node_name      = "frodo" -> null
-       overwrite      = true -> null
-       timeout_upload = ***800 -> null
-
       source_raw {
-           data      = <<-EOT
                #cloud-config
                hostname: test-ubuntu
                timezone: Asia/Manila
                package_update: true
                packages:
-                   qemu-guest-agent
-                   net-tools
-                   curl
                runcmd:
-                   systemctl enable qemu-guest-agent
-                   systemctl start qemu-guest-agent
-                   echo "done" > /tmp/cloud-config.done
            EOT -> null
-           file_name = "user-data-cloud-config.yaml" -> null
-           resize    = 0 -> null
        }
    }

  # module.launch_instance["vm-test-03"].proxmox_virtual_environment_vm.server will be destroyed
  # (because module.launch_instance["vm-test-03"] is not in configuration)
-   resource "proxmox_virtual_environment_vm" "server" {
-       acpi                    = true -> null
-       bios                    = "seabios" -> null
-       id                      = "***0***" -> null
-       ipv4_addresses          = [
-           [
-               "***27.0.0.***",
            ],
-           [
-               "***92.***68.5***.33",
            ],
        ] -> null
-       ipv6_addresses          = [
-           [
-               "::***",
            ],
-           [
-               "fe80::be24:******ff:feef:809",
            ],
        ] -> null
-       keyboard_layout         = "en-us" -> null
-       mac_addresses           = [
-           "00:00:00:00:00:00",
-           "BC:24:******:EF:08:09",
        ] -> null
-       migrate                 = false -> null
-       name                    = "vm-test-03" -> null
-       network_interface_names = [
-           "lo",
-           "eth0",
        ] -> null
-       node_name               = "frodo" -> null
-       on_boot                 = true -> null
-       protection              = false -> null
-       reboot                  = false -> null
-       reboot_after_update     = true -> null
-       scsi_hardware           = "virtio-scsi-pci" -> null
-       started                 = true -> null
-       stop_on_destroy         = true -> null
-       tablet_device           = true -> null
-       tags                    = [
-           "app3",
-           "linux",
        ] -> null
-       template                = false -> null
-       timeout_clone           = ***800 -> null
-       timeout_create          = ***800 -> null
-       timeout_migrate         = ***800 -> null
-       timeout_move_disk       = ***800 -> null
-       timeout_reboot          = ***800 -> null
-       timeout_shutdown_vm     = ***800 -> null
-       timeout_start_vm        = ***800 -> null
-       timeout_stop_vm         = 300 -> null
-       vm_id                   = ***0*** -> null
        # (3 unchanged attributes hidden)
-
       agent {
-           enabled = true -> null
-           timeout = "***5m" -> null
-           trim    = false -> null
-           type    = "virtio" -> null
        }
-
       cpu {
-           cores        = 2 -> null
-           flags        = [] -> null
-           hotplugged   = 0 -> null
-           limit        = 0 -> null
-           numa         = false -> null
-           sockets      = *** -> null
-           type         = "qemu64" -> null
-           units        = ***00 -> null
            # (2 unchanged attributes hidden)
        }
-
       disk {
-           aio               = "io_uring" -> null
-           backup            = true -> null
-           cache             = "none" -> null
-           datastore_id      = "local-lvm" -> null
-           discard           = "on" -> null
-           file_format       = "raw" -> null
-           file_id           = "local:iso/noble-server-cloudimg-amd64.qcow2.img" -> null
-           interface         = "virtio0" -> null
-           iothread          = true -> null
-           path_in_datastore = "vm-***0***-disk-0" -> null
-           replicate         = true -> null
-           size              = 30 -> null
-           ssd               = false -> null
            # (2 unchanged attributes hidden)
        }
-
       initialization {
-           datastore_id         = "local-lvm" -> null
-           interface            = "ide2" -> null
            # (5 unchanged attributes hidden)
-
           dns {
-               domain  = "infradead.internal" -> null
-               servers = [
-                   "***.***.***.***",
-                   "8.8.8.8",
                ] -> null
            }
-
           ip_config {
-               ipv4 {
-                   address = "***92.***68.5***.33/24" -> null
-                   gateway = "***92.***68.5***.***" -> null
                }
            }
-
           user_account {
-               keys     = [
-                   "***",
                ] -> null
-               password = (sensitive value) -> null
-               username = (sensitive value) -> null
            }
        }
-
       memory {
-           dedicated      = ***024 -> null
-           floating       = 0 -> null
-           keep_hugepages = false -> null
-           shared         = 0 -> null
            # (*** unchanged attribute hidden)
        }
-
       network_device {
-           bridge       = "vmbr0" -> null
-           disconnected = false -> null
-           enabled      = true -> null
-           firewall     = false -> null
-           mac_address  = "BC:24:******:EF:08:09" -> null
-           model        = "virtio" -> null
-           mtu          = 0 -> null
-           queues       = 0 -> null
-           rate_limit   = 0 -> null
-           vlan_id      = (sensitive value) -> null
            # (*** unchanged attribute hidden)
        }
    }

  # module.launch_instance["vm-test-04"].proxmox_virtual_environment_file.user_data_cloud_config will be destroyed
  # (because module.launch_instance["vm-test-04"] is not in configuration)
-   resource "proxmox_virtual_environment_file" "user_data_cloud_config" {
-       content_type   = "snippets" -> null
-       datastore_id   = "local" -> null
-       file_name      = "user-data-cloud-config.yaml" -> null
-       id             = "local:snippets/user-data-cloud-config.yaml" -> null
-       node_name      = "frodo" -> null
-       overwrite      = true -> null
-       timeout_upload = ***800 -> null
-
       source_raw {
-           data      = <<-EOT
                #cloud-config
                hostname: test-ubuntu
                timezone: Asia/Manila
                package_update: true
                packages:
-                   qemu-guest-agent
-                   net-tools
-                   curl
                runcmd:
-                   systemctl enable qemu-guest-agent
-                   systemctl start qemu-guest-agent
-                   echo "done" > /tmp/cloud-config.done
            EOT -> null
-           file_name = "user-data-cloud-config.yaml" -> null
-           resize    = 0 -> null
        }
    }

  # module.launch_instance["vm-test-04"].proxmox_virtual_environment_vm.server will be destroyed
  # (because module.launch_instance["vm-test-04"] is not in configuration)
-   resource "proxmox_virtual_environment_vm" "server" {
-       acpi                    = true -> null
-       bios                    = "seabios" -> null
-       id                      = "***00" -> null
-       ipv4_addresses          = [
-           [
-               "***27.0.0.***",
            ],
-           [
-               "***92.***68.5***.34",
            ],
        ] -> null
-       ipv6_addresses          = [
-           [
-               "::***",
            ],
-           [
-               "fe80::be24:******ff:fe79:b9***c",
            ],
        ] -> null
-       keyboard_layout         = "en-us" -> null
-       mac_addresses           = [
-           "00:00:00:00:00:00",
-           "BC:24:******:79:B9:***C",
        ] -> null
-       migrate                 = false -> null
-       name                    = "vm-test-04" -> null
-       network_interface_names = [
-           "lo",
-           "eth0",
        ] -> null
-       node_name               = "frodo" -> null
-       on_boot                 = true -> null
-       protection              = false -> null
-       reboot                  = false -> null
-       reboot_after_update     = true -> null
-       scsi_hardware           = "virtio-scsi-pci" -> null
-       started                 = true -> null
-       stop_on_destroy         = true -> null
-       tablet_device           = true -> null
-       tags                    = [
-           "app4",
-           "linux",
        ] -> null
-       template                = false -> null
-       timeout_clone           = ***800 -> null
-       timeout_create          = ***800 -> null
-       timeout_migrate         = ***800 -> null
-       timeout_move_disk       = ***800 -> null
-       timeout_reboot          = ***800 -> null
-       timeout_shutdown_vm     = ***800 -> null
-       timeout_start_vm        = ***800 -> null
-       timeout_stop_vm         = 300 -> null
-       vm_id                   = ***00 -> null
        # (3 unchanged attributes hidden)
-
       agent {
-           enabled = true -> null
-           timeout = "***5m" -> null
-           trim    = false -> null
-           type    = "virtio" -> null
        }
-
       cpu {
-           cores        = 2 -> null
-           flags        = [] -> null
-           hotplugged   = 0 -> null
-           limit        = 0 -> null
-           numa         = false -> null
-           sockets      = *** -> null
-           type         = "qemu64" -> null
-           units        = ***00 -> null
            # (2 unchanged attributes hidden)
        }
-
       disk {
-           aio               = "io_uring" -> null
-           backup            = true -> null
-           cache             = "none" -> null
-           datastore_id      = "local-lvm" -> null
-           discard           = "on" -> null
-           file_format       = "raw" -> null
-           file_id           = "local:iso/jammy-server-cloudimg-amd64.qcow2.img" -> null
-           interface         = "virtio0" -> null
-           iothread          = true -> null
-           path_in_datastore = "vm-***00-disk-0" -> null
-           replicate         = true -> null
-           size              = 30 -> null
-           ssd               = false -> null
            # (2 unchanged attributes hidden)
        }
-
       initialization {
-           datastore_id         = "local-lvm" -> null
-           interface            = "ide2" -> null
            # (5 unchanged attributes hidden)
-
           dns {
-               domain  = "infradead.internal" -> null
-               servers = [
-                   "***.***.***.***",
-                   "8.8.8.8",
                ] -> null
            }
-
           ip_config {
-               ipv4 {
-                   address = "***92.***68.5***.34/24" -> null
-                   gateway = "***92.***68.5***.***" -> null
                }
            }
-
           user_account {
-               keys     = [
-                   "***",
                ] -> null
-               password = (sensitive value) -> null
-               username = (sensitive value) -> null
            }
        }
-
       memory {
-           dedicated      = ***024 -> null
-           floating       = 0 -> null
-           keep_hugepages = false -> null
-           shared         = 0 -> null
            # (*** unchanged attribute hidden)
        }
-
       network_device {
-           bridge       = "vmbr0" -> null
-           disconnected = false -> null
-           enabled      = true -> null
-           firewall     = false -> null
-           mac_address  = "BC:24:******:79:B9:***C" -> null
-           model        = "virtio" -> null
-           mtu          = 0 -> null
-           queues       = 0 -> null
-           rate_limit   = 0 -> null
-           vlan_id      = (sensitive value) -> null
            # (*** unchanged attribute hidden)
        }
    }

Plan: 2 to add, 0 to change, 6 to destroy.

Changes to Outputs:
!   launch_instance = [
        # (*** unchanged element hidden)
        "vm-test-02",
-       "vm-test-03",
-       "vm-test-04",
    ]

```

</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>